//===========================================
//===========================================
// Фильтрация уникальных элементов массива
//===========================================
//===========================================
/*
Допустим, у нас есть массив arr.

Создайте функцию unique(arr), которая вернёт 
массив уникальных, не повторяющихся значений 
массива arr.
*/
{
    function unique(arr) {
        /* ваш код */
        return Array.from(new Set(arr)).join();
      }
      
      let values = ["Hare", "Krishna", "Hare", 
      "Krishna", "Krishna", "Krishna", "Hare", 
      "Hare", ":-O"
      ];
      
    //   console.log(unique(values)); 
      // Hare,Krishna,:-O
}


//============================================
//============================================
//          Отфильтруйте анаграммы
//============================================
//============================================
/*
Анаграммы – это слова, у которых те же буквы 
в том же количестве, но они располагаются 
в другом порядке.

Например:

nap - pan
ear - are - era
cheaters - hectares - teachers
Напишите функцию aclean(arr), которая 
возвращает массив слов, очищенный от анаграмм.

Из каждой группы анаграмм должно остаться 
только одно слово, не важно какое.

"nap,teachers,ear" или "PAN,cheaters,era"
*/
{
    let arr = ["nap", "teachers", "cheaters", 
    "PAN", "ear", "era", "hectares"];

    function aclean(arr) {
        let anag = new Map();
        arr.forEach(item => {
            anag.set(item.toLowerCase()
            .split('')
            .sort()
            .join('')
                , item)
        });
        return Array.from(anag.values());
    }

    // console.log(aclean(arr));
}



//============================================
//============================================
//          Перебираемые ключи
//============================================
//============================================
/*
Мы хотели бы получить массив ключей map.keys() 
в переменную и далее работать с ними, 
например, применить метод .push.
*/
{
    let map = new Map();

map.set("name", "John");

let keys = Array.from(map.keys());

// Error: keys.push is not a function
// Ошибка: keys.push -- это не функция
keys.push("more");
// console.log(keys);
}