/* =============================================================
-----------------  from YOUTUBE (IT-KAMASUTRA) -----------------
============================================================= */
{ // 1 ---------------------------------------------------------
    // console.log(({}).prototype === ({}).__proto__);


}//------------------------------------------------------------

{ // 2 --------------------------------------------------------
    // function ITKamasutra() {}
    // console.log(ITKamasutra.prototype === ITKamasutra.__proto__);


}//-------------------------------------------------------------

{ // 3 ---------------------------------------------------------
    // function ITKamasutra() {}
    // function ITIncubator (){}
    // console.log(ITKamasutra.__proto__ === ITIncubator.__proto__);
    // console.log(ITKamasutra.prototype === ITIncubator.prototype);


}//-------------------------------------------------------------

{ // 4 ---------------------------------------------------------
    // let Component = (props) => {
    //     return `<div> I don't know Prototype</div>`
    // }
    // console.log(Component.prototype === Object.prototype);


}//-------------------------------------------------------------

{ // 5 --------------------------------------------------------
    // let age = 18;
    // console.log(age.prototype === Number.prototype);
    // console.log(age.__proto__ === Number.prototype);


}//-------------------------------------------------------------

{ // 6 ---------------------------------------------------------
    // class Hacker {}
    // console.log(Hacker.__proto__ === Function.prototype);


}//-------------------------------------------------------------

{ // 7 ---------------------------------------------------------
    // function ITIncubator(){}
    // console.log(ITIncubator.__proto__ === '???');


}//-------------------------------------------------------------

{ // 8 --------------------------------------------------------
    // let count = 12;
    // console.log(count.__proto__ === '???');


}//------------------------------------------------------------


/* =============================================================
        -----------------  Road Map 6Seniors   -----------------
============================================================= */
/*
1. Как осуществить прототипное наследование?
2. Как осущесвтить наследование свойства в this?
3. Как создать объект без прототипа?
4. Как изменить прототип у созданного объекта?
5. Как получить прототип у объекта/числа/строки?
 */

